## MiSTer2MEGA65
##
## MEGA65 port done by MJoergen and sy2002 in 2023 and licensed under GPL v3
##
## M2M constraints common for all board variants.

################################
## TIMING CONSTRAINTS
################################

## System board clock (100 MHz)
create_clock -period 10.000 -name clk [get_ports {clk_i}]

## Name Autogenerated Clocks
create_generated_clock -name qnice_clk     [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT0]
create_generated_clock -name hr_clk_x1     [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT1]
create_generated_clock -name hr_clk_x2     [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT2]
create_generated_clock -name hr_clk_x2_del [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT3]
create_generated_clock -name audio_clk     [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT4]
create_generated_clock -name tmds_clk      [get_pins i_framework/i_video_out_clock/MMCM/CLKOUT0]
create_generated_clock -name hdmi_clk      [get_pins i_framework/i_video_out_clock/MMCM/CLKOUT1]

## Clock divider sdcard_clk that creates the 25 MHz used by sd_spi.vhd
create_generated_clock -name sdcard_clk -source [get_pins i_framework/i_clk_m2m/i_clk_qnice/CLKOUT0] -divide_by 2 [get_pins i_framework/QNICE_SOC/sd_card/Slow_Clock_25MHz_reg/Q]

## The following constraints are needed by M2M/vhdl/controllers/HDMI/video_out_clock.vhd
create_generated_clock -name div_clk -source [get_ports {clk_i}] -divide_by 2 [get_pins i_framework/i_video_out_clock/clki_div_reg/Q]
set_false_path -through [get_pins i_framework/i_video_out_clock/U_BUFG_1/S1]
set_case_analysis 1 [get_pins i_framework/i_video_out_clock/clk_mux_reg/Q]

## Generic CDC
set_max_delay 8 -datapath_only -from [get_clocks] -to [get_pins -hierarchical "*cdc_stable_gen.dst_*_d_reg[*]/D"]

## QNICE's EAE combinatorial division networks take longer than the regular clock period, so we specify a multicycle path
## see also the comments in EAE.vhd and explanations in UG903/chapter 5/Multicycle Paths as well as ug911/page 25
set_multicycle_path -from [get_cells -include_replicated {{i_framework/QNICE_SOC/eae_inst/op0_reg[*]} {i_framework/QNICE_SOC/eae_inst/op1_reg[*]}}] \
   -to [get_cells -include_replicated {i_framework/QNICE_SOC/eae_inst/res_reg[*]}] -setup 3
set_multicycle_path -from [get_cells -include_replicated {{i_framework/QNICE_SOC/eae_inst/op0_reg[*]} {i_framework/QNICE_SOC/eae_inst/op1_reg[*]}}] \
   -to [get_cells -include_replicated {i_framework/QNICE_SOC/eae_inst/res_reg[*]}] -hold 2

# Timing between the two system clocks, ascal.vhd, audio, HDMI and HyperRAM is asynchronous.
# The HyperRAM operates with three different clock domains, and the signals are
# consistently named accordingly:
# i_*   : This is the input stream, i.e. the Core clock domain.
# o_*   : This is the output stream, i.e. the HDMI clock domain.
# avl_* : This is the video buffer, i.e. the HyperRAM clock domain.
# However, we can not refer directly to the Core clock domain here, so instead we make
# some indirect references.
set_false_path -quiet -from [get_pins -hierarchical -regexp ".*/i_ascal/i_.*_reg.*/C"]   -to [get_pins -hierarchical -regexp ".*/i_ascal/avl_.*_reg.*/D"]
set_false_path -quiet -from [get_pins -hierarchical -regexp ".*/i_ascal/i_.*_reg.*/C"]   -to [get_pins -hierarchical -regexp ".*/i_ascal/o_.*_reg.*/D"]
set_false_path -quiet -from [get_pins -hierarchical -regexp ".*/i_ascal/avl_.*_reg.*/C"] -to [get_pins -hierarchical -regexp ".*/i_ascal/o_.*_reg.*/D"]
set_false_path -quiet -from [get_pins -hierarchical -regexp ".*/i_ascal/o_.*_reg.*/C"]   -to [get_pins -hierarchical -regexp ".*/i_ascal/i_.*_reg.*/D"]
set_false_path -quiet -from [get_pins -hierarchical -regexp ".*/i_ascal/o_.*_reg.*/C"]   -to [get_pins -hierarchical -regexp ".*/i_ascal/avl_.*_reg.*/D"]

set_false_path -from [get_clocks qnice_clk] -to [get_clocks hdmi_clk]
set_false_path   -through [get_pins i_framework/i_av_pipeline/i_digital_pipeline/i_ascal/reset_na]

## The high level reset signals are slow enough so that we can afford a false path
set_false_path -from [get_pins i_framework/i_reset_manager/reset_m2m_n_o_reg/C]
set_false_path -from [get_pins i_framework/i_reset_manager/reset_core_n_o_reg/C]


################################
## CONFIGURATION AND BITSTREAM PROPERTIES
################################

set_property CONFIG_VOLTAGE                  3.3   [current_design]
set_property CFGBVS                          VCCO  [current_design]
set_property BITSTREAM.GENERAL.COMPRESS      TRUE  [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE     66    [current_design]
set_property CONFIG_MODE                     SPIx4 [current_design]
set_property BITSTREAM.CONFIG.SPI_32BIT_ADDR YES   [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH   4     [current_design]

